/*------------------------------------------------------------------------------
-- 개체 이름 : ADDRESS_ID_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE ADDRESS_ID_SEQ
    START WITH 11000
    INCREMENT BY 1
    MAXVALUE 99999
    MINVALUE 11000
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : BIZ_ID_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE BIZ_ID_SEQ
    START WITH 1000040
    INCREMENT BY 1
    MAXVALUE 1999990
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : CODE_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE CODE_SEQ
    START WITH 1020
    INCREMENT BY 1
    MAXVALUE 9999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : COMP_ID_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE COMP_ID_SEQ
    START WITH 2000160
    INCREMENT BY 1
    MAXVALUE 2999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : GROUP_ID_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE GROUP_ID_SEQ
    START WITH 3000000
    INCREMENT BY 1
    MAXVALUE 3999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : MASTER_CD_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE MASTER_CD_SEQ
    START WITH 0
    INCREMENT BY 1
    MAXVALUE 999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : REPORT_GROUP_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE REPORT_GROUP_SEQ
    START WITH 0
    INCREMENT BY 1
    MAXVALUE 999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : SMS_MSG_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE SMS_MSG_SEQ
    START WITH 0
    INCREMENT BY 1
    MAXVALUE 9999999999
    MINVALUE 0
    CYCLE
    CACHE 20
    NOORDER;


/*------------------------------------------------------------------------------
-- 개체 이름 : SMS_RULE_ID_SEQ
-- 만든 날짜 : 2012-08-27 오전 11:49:34
-- 마지막으로 수정한 날짜 : 2012-08-27 오전 11:49:34
-- 상태 : VALID
------------------------------------------------------------------------------*/
CREATE SEQUENCE SMS_RULE_ID_SEQ
    START WITH 4000000
    INCREMENT BY 1
    MAXVALUE 4999999
    MINVALUE 0
    NOCYCLE
    CACHE 20
    NOORDER;

